[{"title":"LLM Experimental Page","content":"<a href=\"https:\/\/ryanmccullough.dev\/llm\/\">ryanmccullough.dev\/llm\/<\/a><br>\nFirst attempt at beginning an LLM journey. Some work goals will be to create a prompt that writes an SVG or EPS script for repetitive graphic creation shapes. Such as a base for sign creation. Such as \"Create a 14\" x 10\" sign, 3\/4\" corner rounds, 1\/4\" corner holes @ 3\/4\" in from corner, 2 center holes @  5\/16\", 1\/2\" in from edge.\" I'm curious how effective an LLM would be for this versus dynamic form fields with filtered dropdowns, check boxes, etc. Maybe finding a way to combine the two would be most effective and fun. \n\nEventually creating parameters for OSHA\/ANSI compliant headers and text size requirements will be the end goal. Possibly suggested variations that are based on exact OSHA\/ANSI guidelines. While creating the OSHA version showing the ANSI alternative side by side using LLM.\n"},{"title":"Ai as a mentor and an assistant.","content":"I've always been interested in coding from scratch instead of relying on bulky precoded templates. I never had a coding mentor. It seems Ai has become my coding mentor and my assistant. Coding has always been my main interest so for a very long time research has stacked an stacked. Never having a job would stifle my flourishing in it. Not understanding the structure enough to just sit in type but always understood it. There were just enough gaps in my understanding to achieve a grueling amount of hours put in for miniscule results. Frustrating\/discouraging to say the least. Now with Ai as an aide my website is where it was supposed to be a year ago within two days. Use this new powerful tool and flourish."},{"title":"Vulcan Project - Standard Procedures","content":"At the point where most calculations work but need to add missing\/unthoughtof calculations. Like welding parts and their weights\/lengths, like angled aluminum cut down."},{"title":"Personal Project - This Website","content":"Initial step is adding this PHP and JSON functionality to feed\/log progress."}]